cases/pyrolysis1D/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298.15;

boundaryField
{
    outlet          
    {
	type		inletOutlet;
	inletValue	$internalField;
	value		$internalField;
    }

    ground           
    {
        type            zeroGradient;
    }

    side          
    {
	type		inletOutlet;
	inletValue	$internalField;
	value		$internalField;
    }

    frontAndBack    
    {
        type            empty;
    }
   
    region0_to_panelRegion_panel
    {
        type            zeroGradient;
/*
        type          compressible::fixedIncidentRadiationCoupledMixed;
        neighbourFieldName T;
        K               none;
        neighbourFieldRadiativeName none;
        fieldRadiativeName Qr;
        QrIncident      60000;
        emissivityMode	solidRadiation;
        value           $internalField;
*/
    }
}


// ************************************************************************* //
