cases/pyrolysis1D/0/Ydefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ydefault;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.;

boundaryField
{
    outlet      
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    ground           
    {
        type            zeroGradient;
    }

    side          
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    frontAndBack
    {
        type            empty;
    }

    region0_to_panelRegion_panel
    {
        type            totalFlowRateAdvectiveDiffusive;
        massFluxFraction 0;
        value           uniform 0;
/*
        type                zeroFlowRateAdvectiveDiffusive;
        phi                 phi;
        rho                 rho;
        value               uniform 0;
*/
    }
}


// ************************************************************************* //
