cases/pyrolysis1D/0/alphaSgs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphaSgs;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outlet      
    {
        type            zeroGradient;
    }
    ground           
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    side
    {
        type            zeroGradient;
    }
    region0_to_panelRegion_panel
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
