cases/pyrolysis1D/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    outlet      
    {
        type            calculated;
        value           $internalField;
    }

    ground           
    {
        type            calculated;
        value           $internalField;
    }

    side          
    {
        type            calculated;
        value           $internalField;
    }

    frontAndBack
    {
        type            empty;
    }

    region0_to_panelRegion_panel
    {
        type            calculated;
        value           $internalField;
    }
}


// ************************************************************************* //
