cases/pyrolysis1D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     fireFoam;

startFrom       startTime;

startTime       0.;

stopAt          endTime;

endTime         100; 

deltaT          0.2; //0.1;

writeControl    adjustableRunTime;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable yes;

//adjustTimeStep  yes;
adjustTimeStep  no;

maxCo           1.0;

maxDi           0.5;

maxDeltaT       0.1;

libs
(
    "libfvPatchFieldsPyrolysis.so"
);

functions
(
    patchProbes
    {
        type            patchProbes;
        functionObjectLibs ("libsampling.so");
        outputControl   timeStep;
        outputInterval  10;
        region        panelRegion;
        patchName      region0_to_panelRegion_panel;
        probeLocations
        (
            ( 0.00 0.5 0.5 )
        );
        fields
        (
            rho
            T
        );
    }

    patchProbes
    {
        type            patchProbes;
        functionObjectLibs ("libsampling.so");
        outputControl   timeStep;
        outputInterval  10;
        patchName      region0_to_panelRegion_panel;
        probeLocations
        (
            ( 0.00 0.5 0.5 )
        );
        fields
        (
            rho
            T
            U 
        );
    }

    probes
    {
        type            probes;
        functionObjectLibs ("libsampling.so");
        outputControl   timeStep;
        outputInterval  10;
        region        panelRegion;
        probeLocations
        (
            ( -0.0015 0.5 0.5 )
            ( -0.0044 0.5 0.5 )
            ( -0.0073 0.5 0.5 )
            ( -0.0102 0.5 0.5 )
            ( -0.0132 0.5 0.5 )
            ( -0.0161 0.5 0.5 )
            ( -0.0190 0.5 0.5 )
            ( -0.0219 0.5 0.5 )
        );
        fields
        (
            rho
            wood
            T
            chemistrySh
        );
    }


    patchPanel 
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   timeStep;  //outputTime
        outputInterval  10;
        log             false;
        valueOutput     false;
        source          patch;
        sourceName      region0_to_panelRegion_panel;
        operation       sum;
        fields
        (
            phi
        );
    }


    patchPanelSolid
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        region          panelRegion;
        outputControl   timeStep;  //outputTime
        outputInterval  10;
        log             false;
        valueOutput     false;
        source          patch;
        sourceName      region0_to_panelRegion_panel;
        operation       sum;
        fields
        (
            phiGas
        );
    }

);
************************************************************************* //
